DROP TABLE IF EXISTS `cdata_detail_10`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `cdata_detail_10` (
  `userid` varchar(30) NOT NULL,
  `username` varchar(100) NOT NULL,
  `examdate` varchar(8) NOT NULL,
  `historyno` varchar(3) NOT NULL,
  `dispindex` int(3) NOT NULL,
  `mainclass` varchar(100) DEFAULT NULL,
  `subclass` varchar(100) DEFAULT NULL,
  `context` longtext,
  PRIMARY KEY (`userid`,`examdate`,`historyno`,`dispindex`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='健診結果報告書10 明细数据';

LOCK TABLES `cdata_detail_10` WRITE;
/*!40000 ALTER TABLE `cdata_detail_10` DISABLE KEYS */;
INSERT INTO `cdata_detail_10` VALUES ('U0000002','本田慶応','20190101','1',0,'胸部CT','判定','1.0'),('U0000002','本田慶応','20190101','1',1,'胸部CT','本次','2.0'),('U0000002','本田慶応','20190101','1',2,'胸部CT','上次','3.0'),('U0000002','本田慶応','20190101','1',3,'胸部CT','上上次','4.0'),('U0000002','本田慶応','20190101','1',4,'胸部CT','本次','5.0'),('U0000002','本田慶応','20190101','1',5,'胸部CT','上次','6.0'),('U0000002','本田慶応','20190101','1',6,'胸部CT','上上次','7.0'),('U0000002','本田慶応','20190101','1',7,'胸部CT','本次','8.0'),('U0000002','本田慶応','20190101','1',8,'胸部CT','上次','9.0'),('U0000002','本田慶応','20190101','1',9,'胸部CT','上上次','10.0'),('U0000002','本田慶応','20190101','1',10,'胸部CT','本次','11.0'),('U0000002','本田慶応','20190101','1',11,'胸部CT','上次','12.0'),('U0000002','本田慶応','20190101','1',12,'胸部CT','上上次','13.0'),('U0000002','本田慶応','20190101','1',13,'腹部CT','判定','14.0'),('U0000002','本田慶応','20190101','1',14,'腹部CT','本次','15.0'),('U0000002','本田慶応','20190101','1',15,'腹部CT','上次','16.0'),('U0000002','本田慶応','20190101','1',16,'腹部CT','上上次','17.0'),('U0000002','本田慶応','20190101','1',17,'腹部CT','本次','18.0'),('U0000002','本田慶応','20190101','1',18,'腹部CT','上次','19.0'),('U0000002','本田慶応','20190101','1',19,'腹部CT','上上次','20.0'),('U0000002','本田慶応','20190101','1',20,'腹部CT','本次','21.0'),('U0000002','本田慶応','20190101','1',21,'腹部CT','上次','22.0'),('U0000002','本田慶応','20190101','1',22,'腹部CT','上上次','23.0'),('U0000002','本田慶応','20190101','1',23,'腹部CT','本次','24.0'),('U0000002','本田慶応','20190101','1',24,'腹部CT','上次','25.0'),('U0000002','本田慶応','20190101','1',25,'腹部CT','上上次','26.0'),('U0000002','本田慶応','20190101','1',26,'MRI/MRA','判定','27.0'),('U0000002','本田慶応','20190101','1',27,'MRI/MRA','本次','28.0'),('U0000002','本田慶応','20190101','1',28,'MRI/MRA','上次','29.0'),('U0000002','本田慶応','20190101','1',29,'MRI/MRA','上上次','30.0'),('U0000002','本田慶応','20190101','1',30,'MRI/MRA','本次','31.0'),('U0000002','本田慶応','20190101','1',31,'MRI/MRA','上次','32.0'),('U0000002','本田慶応','20190101','1',32,'MRI/MRA','上上次','33.0'),('U0000002','本田慶応','20190101','1',33,'MRI/MRA','本次','34.0'),('U0000002','本田慶応','20190101','1',34,'MRI/MRA','上次','35.0'),('U0000002','本田慶応','20190101','1',35,'MRI/MRA','上上次','36.0'),('U0000002','本田慶応','20190101','1',36,'MRI/MRA','本次','37.0'),('U0000002','本田慶応','20190101','1',37,'MRI/MRA','上次','38.0'),('U0000002','本田慶応','20190101','1',38,'MRI/MRA','上上次','39.0'),('U0000002','本田慶応','20190101','1',39,'颈部超声','判定','40.0'),('U0000002','本田慶応','20190101','1',40,'颈部超声','本次','41.0'),('U0000002','本田慶応','20190101','1',41,'颈部超声','上次','42.0'),('U0000002','本田慶応','20190101','1',42,'颈部超声','上上次','43.0'),('U0000002','本田慶応','20190101','1',43,'颈部超声','本次','44.0'),('U0000002','本田慶応','20190101','1',44,'颈部超声','上次','45.0'),('U0000002','本田慶応','20190101','1',45,'颈部超声','上上次','46.0'),('U0000002','本田慶応','20190101','1',46,'颈部超声','本次','47.0'),('U0000002','本田慶応','20190101','1',47,'颈部超声','上次','48.0'),('U0000002','本田慶応','20190101','1',48,'颈部超声','上上次','49.0'),('U0000002','本田慶応','20190101','1',49,'颈部超声','本次','50.0'),('U0000002','本田慶応','20190101','1',50,'颈部超声','上次','51.0'),('U0000002','本田慶応','20190101','1',51,'颈部超声','上上次','52.0');
/*!40000 ALTER TABLE `cdata_detail_10` ENABLE KEYS */;
UNLOCK TABLES;