-- MySQL dump 10.13  Distrib 5.7.17, for Win64 (x86_64)
--
-- Host: localhost    Database: emedicare
-- ------------------------------------------------------
-- Server version	5.7.20-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `cdata_detail_02`
--

DROP TABLE IF EXISTS `cdata_detail_02`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `cdata_detail_02` (
  `userid` varchar(30) NOT NULL,
  `username` varchar(100) NOT NULL,
  `examdate` varchar(8) NOT NULL,
  `historyno` varchar(3) NOT NULL,
  `dispindex` int(11) NOT NULL,
  `mainclass` varchar(100) DEFAULT NULL,
  `subclass` varchar(100) DEFAULT NULL,
  `context` longtext,
  PRIMARY KEY (`userid`,`examdate`,`historyno`,`dispindex`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='健診結果報告書2明细数据';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cdata_detail_02`
--

LOCK TABLES `cdata_detail_02` WRITE;
/*!40000 ALTER TABLE `cdata_detail_02` DISABLE KEYS */;
INSERT INTO `cdata_detail_02` VALUES ('U0000002','本田慶応','20190101','1',0,'判定','判定','1.0'),('U0000002','本田慶応','20190101','1',1,'诊察所见','本次','2.0'),('U0000002','本田慶応','20190101','1',2,'诊察所见','上次','3.0'),('U0000002','本田慶応','20190101','1',3,'诊察所见','上上次','4.0'),('U0000002','本田慶応','20190101','1',4,'诊察所见','本次','5.0'),('U0000002','本田慶応','20190101','1',5,'诊察所见','上次','6.0'),('U0000002','本田慶応','20190101','1',6,'诊察所见','上上次','7.0'),('U0000002','本田慶応','20190101','1',7,'身体测量','判定','8.0'),('U0000002','本田慶応','20190101','1',8,'身高','标准值/单位','9.0'),('U0000002','本田慶応','20190101','1',9,'身高','本次','10.0'),('U0000002','本田慶応','20190101','1',10,'体重','标准值/单位','11.0'),('U0000002','本田慶応','20190101','1',11,'体重','本次','12.0'),('U0000002','本田慶応','20190101','1',12,'标准体重','标准值/单位','13.0'),('U0000002','本田慶応','20190101','1',13,'标准体重','本次','14.0'),('U0000002','本田慶応','20190101','1',14,'肥胖度','标准值/单位','15.0'),('U0000002','本田慶応','20190101','1',15,'肥胖度','本次','16.0'),('U0000002','本田慶応','20190101','1',16,'BMI指数','标准值/单位','17.0'),('U0000002','本田慶応','20190101','1',17,'BMI指数','本次','18.0'),('U0000002','本田慶応','20190101','1',18,'腹围(cm)','标准值/单位','19.0'),('U0000002','本田慶応','20190101','1',19,'腹围(cm)','本次','20.0'),('U0000002','本田慶応','20190101','1',20,'体脂肪率','标准值/单位','21.0'),('U0000002','本田慶応','20190101','1',21,'体脂肪率','本次','22.0'),('U0000002','本田慶応','20190101','1',22,'身体测量','检查项目','23.0'),('U0000002','本田慶応','20190101','1',23,'身体测量','标准值/单位','24.0'),('U0000002','本田慶応','20190101','1',24,'身体测量','本次','25.0'),('U0000002','本田慶応','20190101','1',25,'身体测量','','26.0'),('U0000002','本田慶応','20190101','1',26,'血压','判定','27.0'),('U0000002','本田慶応','20190101','1',27,'高压','标准值/单位','28.0'),('U0000002','本田慶応','20190101','1',28,'高压','本次','29.0'),('U0000002','本田慶応','20190101','1',29,'低压','标准值/单位','30.0'),('U0000002','本田慶応','20190101','1',30,'低压','本次','31.0'),('U0000002','本田慶応','20190101','1',31,'血压','检查项目','32.0'),('U0000002','本田慶応','20190101','1',32,'血压','标准值/单位','33.0'),('U0000002','本田慶応','20190101','1',33,'血压','本次','34.0'),('U0000002','本田慶応','20190101','1',34,'血压','','35.0'),('U0000002','本田慶応','20190101','1',35,'视力','判定','36.0'),('U0000002','本田慶応','20190101','1',36,'矫正视力（右）','标准值/单位','37.0'),('U0000002','本田慶応','20190101','1',37,'矫正视力（右）','本次','38.0'),('U0000002','本田慶応','20190101','1',38,'矫正视力（右）','标准值/单位','39.0'),('U0000002','本田慶応','20190101','1',39,'矫正视力（右）','本次','40.0'),('U0000002','本田慶応','20190101','1',40,'视力','检查项目','41.0'),('U0000002','本田慶応','20190101','1',41,'视力','标准值/单位','42.0'),('U0000002','本田慶応','20190101','1',42,'视力','本次','43.0'),('U0000002','本田慶応','20190101','1',43,'视力','','44.0'),('U0000002','本田慶応','20190101','1',44,'听力','判定','45.0'),('U0000002','本田慶応','20190101','1',45,'听力','检查项目','46.0'),('U0000002','本田慶応','20190101','1',46,'听力','标准值/单位','47.0'),('U0000002','本田慶応','20190101','1',47,'听力','本次','48.0'),('U0000002','本田慶応','20190101','1',48,'听力','检查项目','49.0'),('U0000002','本田慶応','20190101','1',49,'听力','标准值/单位','50.0'),('U0000002','本田慶応','20190101','1',50,'听力','本次','51.0'),('U0000002','本田慶応','20190101','1',51,'听力','检查项目','52.0'),('U0000002','本田慶応','20190101','1',52,'听力','标准值/单位','53.0'),('U0000002','本田慶応','20190101','1',53,'听力','本次','54.0'),('U0000002','本田慶応','20190101','1',54,'听力','检查项目','55.0'),('U0000002','本田慶応','20190101','1',55,'听力','标准值/单位','56.0'),('U0000002','本田慶応','20190101','1',56,'听力','本次','57.0'),('U0000002','本田慶応','20190101','1',57,'听力','检查项目','58.0'),('U0000002','本田慶応','20190101','1',58,'听力','标准值/单位','59.0'),('U0000002','本田慶応','20190101','1',59,'听力','本次','60.0'),('U0000002','本田慶応','20190101','1',60,'视力','','61.0');
/*!40000 ALTER TABLE `cdata_detail_02` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2018-07-23  0:05:21
